# 커피지수
## 1. 데이로부터 4개 커피샾에대한 정보 추출해서 저장하기

In [356]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [357]:
from google.colab import drive
drive.mount('/content/mnt')

Drive already mounted at /content/mnt; to attempt to forcibly remount, call drive.mount("/content/mnt", force_remount=True).

In [358]:
data_folder = '/content/mnt/MyDrive/data/소상공인시장진흥공단_상가(상권)정보_20210630'

In [359]:
from glob import glob
file_list = []
for file in glob(f'{data_folder}/*.csv'):
  file_list.append(file)

In [360]:
file_list[10]

'/content/mnt/MyDrive/data/소상공인시장진흥공단_상가(상권)정보_20210630/소상공인시장진흥공단_상가(상권)정보_서울_202106.csv'

In [361]:
df = pd.read_csv(file_list[10], encoding = 'utf-8')
print(df.shape)
#상호명, 지점명, 시도명, 시군구명, 도로명주소, 상권업종중분류코드

(316078, 39)

In [362]:
df = df[['상호명', '지점명', '시도명', '시군구명', '도로명주소', '상권업종중분류코드']]
df.head()

     상호명  지점명    시도명  시군구명                  도로명주소 상권업종중분류코드
0    비지트  NaN  서울특별시   서초구    서울특별시 서초구 동광로18길 82       Q01
1   쓰리에프  NaN  서울특별시   동작구  서울특별시 동작구 동작대로27가길 12       Q01
2     채움  NaN  서울특별시   종로구       서울특별시 종로구 삼봉로 81       Q01
3  호구의주방  NaN  서울특별시  영등포구     서울특별시 영등포구 선유로 269       D07
4     다향  NaN  서울특별시   서초구      서울특별시 서초구 효령로 230       Q01

In [363]:
df = df[df.상권업종중분류코드=='Q12']
df.head()

       상호명          지점명    시도명 시군구명                도로명주소 상권업종중분류코드
28     커피빈  코리아대학로대명거리점  서울특별시  종로구     서울특별시 종로구 대명길 25       Q12
111  요거프레소          쌍문점  서울특별시  도봉구      서울특별시 도봉구 도당로 7       Q12
190  메머드커피          NaN  서울특별시  마포구   서울특별시 마포구 와우산로 149       Q12
197  우성커피숍          NaN  서울특별시  양천구     서울특별시 양천구 오목로 48       Q12
225   카페클럽          NaN  서울특별시  송파구  서울특별시 송파구 동남로2길 3-6       Q12

In [364]:
print(df.상호명.value_counts())

카페         414
이디야커피      367
스타벅스       331
투썸플레이스     165
커피빈        115
          ...
테이블스         1
나이스투밋츄       1
소정공방         1
리틀마라캐쉬       1
베러씽스아커밍      1
Name: 상호명, Length: 15019, dtype: int64

In [389]:
shop_name = [['스타벅스','star'], ['이디야','ediya'] , ['커피빈', 'bean'], ['빽다방', 'paik', '빽']]
df2 = pd.DataFrame()
for name_l in shop_name:
  for name in name_l:
    df_n = df[df.상호명.str.contains(name)]
    df_n['상호명'] = df_n.상호명.apply(lambda x : name_l[0])
    df2 = pd.concat([df2,df_n])
df2 = df2.loc[~df2.index.duplicated(keep='first')]

In [390]:
df2.상호명.value_counts()

스타벅스    488
이디야     431
빽다방     252
커피빈     169
Name: 상호명, dtype: int64

In [391]:
df2 = df2.loc[~df2.index.duplicated(keep='first')]

In [392]:
print(df2.index.nunique(),len(df2))

1214 1214

In [393]:
all_coffe_shop = pd.DataFrame()
shop_name = [['스타벅스','star','스타'], ['이디야','ediya'] , ['커피빈', 'bean'], ['빽다방', 'paik']]
file_list = []
for file in glob(f'{data_folder}/*.csv'):
  df = pd.read_csv(file, encoding = 'utf-8')
  df = df[['상호명', '지점명', '시도명', '시군구명', '도로명주소', '상권업종중분류코드']]
  df = df[df.상권업종중분류코드=='Q12']
  df2 = pd.DataFrame()
  for name_l in shop_name:
    for name in name_l:
      df_n = df[df.상호명.str.contains(name)]
      df_n['상호명'] = df_n.상호명.apply(lambda x : name_l[0])
      df2 = pd.concat([df2,df_n])
  df2 = df2.loc[~df2.index.duplicated(keep='first')] #인덱스 중복제거
  all_coffe_shop = pd.concat([df2,all_coffe_shop])

In [335]:
all_coffe_shop.shape

(6588, 6)

In [348]:
df4 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df4

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [349]:
df5 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터1', '데이터2'])
df5

   데이터1  데이터2
a     5     6
c     7     8

In [350]:
df6 = pd.concat([df5, df4])
df6

   데이터1  데이터2
a     5     6
c     7     8
a     0     1
b     2     3
c     4     5

In [351]:
df6 = df6.loc[~df6.index.duplicated(keep='first')]

In [352]:
df6

   데이터1  데이터2
a     5     6
c     7     8
b     2     3